Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz2051ca80176.h
/* ========== PORT definition for TCC4 peripheral ========== */
#define PIN_PC12F_TCC4_WO0                         _UINT32_(76)
#define MUX_PC12F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PC12F_TCC4_WO0                      ((PIN_PC12F_TCC4_WO0 << 16) | MUX_PC12F_TCC4_WO0)
#define PORT_PC12F_TCC4_WO0                        (_UINT32_(1) << 12)

#define PIN_PC29F_TCC4_WO0                         _UINT32_(93)
#define MUX_PC29F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PC29F_TCC4_WO0                      ((PIN_PC29F_TCC4_WO0 << 16) | MUX_PC29F_TCC4_WO0)
#define PORT_PC29F_TCC4_WO0                        (_UINT32_(1) << 29)

#define PIN_PC13F_TCC4_WO1                         _UINT32_(77)
#define MUX_PC13F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PC13F_TCC4_WO1                      ((PIN_PC13F_TCC4_WO1 << 16) | MUX_PC13F_TCC4_WO1)
#define PORT_PC13F_TCC4_WO1                        (_UINT32_(1) << 13)

#define PIN_PD13F_TCC4_WO1                         _UINT32_(109)
#define MUX_PD13F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PD13F_TCC4_WO1                      ((PIN_PD13F_TCC4_WO1 << 16) | MUX_PD13F_TCC4_WO1)
#define PORT_PD13F_TCC4_WO1                        (_UINT32_(1) << 13)

/* ========== PORT definition for TCC5 peripheral ========== */
#define PIN_PC08F_TCC5_WO0                         _UINT32_(72)
#define MUX_PC08F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PC08F_TCC5_WO0                      ((PIN_PC08F_TCC5_WO0 << 16) | MUX_PC08F_TCC5_WO0)
#define PORT_PC08F_TCC5_WO0                        (_UINT32_(1) << 8)

#define PIN_PC23F_TCC5_WO0                         _UINT32_(87)
#define MUX_PC23F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PC23F_TCC5_WO0                      ((PIN_PC23F_TCC5_WO0 << 16) | MUX_PC23F_TCC5_WO0)
#define PORT_PC23F_TCC5_WO0                        (_UINT32_(1) << 23)

#define PIN_PC09F_TCC5_WO1                         _UINT32_(73)
#define MUX_PC09F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PC09F_TCC5_WO1                      ((PIN_PC09F_TCC5_WO1 << 16) | MUX_PC09F_TCC5_WO1)
#define PORT_PC09F_TCC5_WO1                        (_UINT32_(1) << 9)

#define PIN_PC24F_TCC5_WO1                         _UINT32_(88)
#define MUX_PC24F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PC24F_TCC5_WO1                      ((PIN_PC24F_TCC5_WO1 << 16) | MUX_PC24F_TCC5_WO1)
#define PORT_PC24F_TCC5_WO1                        (_UINT32_(1) << 24)

/* ========== PORT definition for TCC6 peripheral ========== */
#define PIN_PC10F_TCC6_WO0                         _UINT32_(74)
#define MUX_PC10F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PC10F_TCC6_WO0                      ((PIN_PC10F_TCC6_WO0 << 16) | MUX_PC10F_TCC6_WO0)
#define PORT_PC10F_TCC6_WO0                        (_UINT32_(1) << 10)

#define PIN_PC21F_TCC6_WO0                         _UINT32_(85)
#define MUX_PC21F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PC21F_TCC6_WO0                      ((PIN_PC21F_TCC6_WO0 << 16) | MUX_PC21F_TCC6_WO0)
#define PORT_PC21F_TCC6_WO0                        (_UINT32_(1) << 21)

#define PIN_PC11F_TCC6_WO1                         _UINT32_(75)
#define MUX_PC11F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PC11F_TCC6_WO1                      ((PIN_PC11F_TCC6_WO1 << 16) | MUX_PC11F_TCC6_WO1)
#define PORT_PC11F_TCC6_WO1                        (_UINT32_(1) << 11)

#define PIN_PC22F_TCC6_WO1                         _UINT32_(86)
#define MUX_PC22F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PC22F_TCC6_WO1                      ((PIN_PC22F_TCC6_WO1 << 16) | MUX_PC22F_TCC6_WO1)
#define PORT_PC22F_TCC6_WO1                        (_UINT32_(1) << 22)

/* ========== PORT definition for TCC7 peripheral ========== */
#define PIN_PA22F_TCC7_WO0                         _UINT32_(22)
#define MUX_PA22F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PA22F_TCC7_WO0                      ((PIN_PA22F_TCC7_WO0 << 16) | MUX_PA22F_TCC7_WO0)
#define PORT_PA22F_TCC7_WO0                        (_UINT32_(1) << 22)

#define PIN_PD08F_TCC7_WO0                         _UINT32_(104)
#define MUX_PD08F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PD08F_TCC7_WO0                      ((PIN_PD08F_TCC7_WO0 << 16) | MUX_PD08F_TCC7_WO0)
#define PORT_PD08F_TCC7_WO0                        (_UINT32_(1) << 8)

#define PIN_PA23F_TCC7_WO1                         _UINT32_(23)
#define MUX_PA23F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PA23F_TCC7_WO1                      ((PIN_PA23F_TCC7_WO1 << 16) | MUX_PA23F_TCC7_WO1)
#define PORT_PA23F_TCC7_WO1                        (_UINT32_(1) << 23)

#define PIN_PD07F_TCC7_WO1                         _UINT32_(103)
#define MUX_PD07F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PD07F_TCC7_WO1                      ((PIN_PD07F_TCC7_WO1 << 16) | MUX_PD07F_TCC7_WO1)
#define PORT_PD07F_TCC7_WO1                        (_UINT32_(1) << 7)

/* ========== PORT definition for TCC8 peripheral ========== */
#define PIN_PA21F_TCC8_WO0                         _UINT32_(21)
#define MUX_PA21F_TCC8_WO0                         _UINT32_(5) 
#define PINMUX_PA21F_TCC8_WO0                      ((PIN_PA21F_TCC8_WO0 << 16) | MUX_PA21F_TCC8_WO0)
#define PORT_PA21F_TCC8_WO0                        (_UINT32_(1) << 21)

#define PIN_PC14F_TCC8_WO0                         _UINT32_(78)
#define MUX_PC14F_TCC8_WO0                         _UINT32_(5) 
#define PINMUX_PC14F_TCC8_WO0                      ((PIN_PC14F_TCC8_WO0 << 16) | MUX_PC14F_TCC8_WO0)
#define PORT_PC14F_TCC8_WO0                        (_UINT32_(1) << 14)

#define PIN_PC15F_TCC8_WO1                         _UINT32_(79)
#define MUX_PC15F_TCC8_WO1                         _UINT32_(5) 
#define PINMUX_PC15F_TCC8_WO1                      ((PIN_PC15F_TCC8_WO1 << 16) | MUX_PC15F_TCC8_WO1)
#define PORT_PC15F_TCC8_WO1                        (_UINT32_(1) << 15)

